content-org/japanese/Ubuntu-Mate.org
#+TITLE: Ubuntu Mate Tips
#+LANGUAGE: ja
#+AUTHOR: 島野 善雄
#+EMAIL: shimano.yoshio@gmail.com
# 出版した日付
#+date: <2023-08-31 Thu>
# 更新日を自動的につける
#+hugo_auto_set_lastmod: t
# 見出しをレベル 6 まで出す
#+OPTIONS: H:6 num:nil
#+OPTIONS: toc:1
#+STARTUP: indent
#+hugo_type: post
# 出力するディレクトリ
#+hugo_base_dir: ../..
# 出版するファイル名
#+hugo_section: japanese/docs
#+OPTIONS: creator:nil author:t
#+LANGUAGE: ja
# Hugo のタグ
#+filetags: Ubuntu "Ubuntu MATE"
# Hugo のカテゴリー
#+hugo_categories: Ubuntu
# #+hugo_custom_front_matter: :thumbnail images/org-to-hugo.svg


** DONE ripgrep （Rust で作られた grep ）を使う
CLOSED: [2023-09-05 Tue 15:32]
:PROPERTIES:
:EXPORT_DATE: <2023-09-04 Mon>
:EXPORT_HUGO_SECTION: japanese/posts
:EXPORT_FILE_NAME: use-ripgrep
:EXPORT_OPTIONS: toc:t num:t
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-09-05 Tue 15:32]
CLOCK: [2023-09-05 Tue 15:15]--[2023-09-05 Tue 15:32] =>  0:17
CLOCK: [2023-09-05 Tue 15:10]--[2023-09-05 Tue 15:13] =>  0:03
CLOCK: [2021-11-23 Tue 10:01]--[2021-11-23 Tue 10:07] =>  0:06
CLOCK: [2021-11-23 Tue 10:00]--[2021-11-23 Tue 10:01] =>  0:01
:END:

ripgrep は Rust で作られた grep です。
次のような特徴があります。

- マルチスレッドで動くので速い
- grep よりも短かくコマンドを書くことができる

詳しくは以下をごらんください。

- [[https://github.com/BurntSushi/ripgrep][BurntSushi/ripgrep: ripgrep recursively searches directories for a regex pattern while respecting your gitignore]]


*** Ubuntu MATE 23.04 への ripgrep インストール

Ubuntu MATE 23.04 に ripgrep をインストールするには
次のようにします:

#+caption: Ubuntu への ripgrep のインストール
#+begin_src sh :eval no
sudo apt-get install ripgrep
#+end_src

*** ripgrep の使いかた

ripgrep を使ってカレントディレクトリを "hoge" に対して再起動に検索するには
次のようにします。

#+caption: ripgrep を使ってカレントディレクトリを "hoge" に対して再起動に検索
#+begin_src sh :eval no
rg hoge
#+end_src

"rg" は ripgrep の実行ファイル名です。

これは次のようにして grep を使った場合と同様です:

#+caption: grep を使ってカレントディレクトリを "hoge" に対して再起動に検索
#+begin_src sh :eval no
grep -r hoge *
#+end_src

ただし、 ripgrep のほうがずっと速く、
コマンドが短か、
出力が読みやすいです。

もちろん日本語も検索できます

#+caption: ripgrep で日本語を検索
#+begin_src sh :eval no
rg カレントディレクトリ
#+end_src

このように出力されます:

#+begin_example
Ubuntu-Mate.org
63:ripgrep を使ってカレントディレクトリを "hoge" に対して再起動に検索するには
66:#+caption: ripgrep を使ってカレントディレクトリを "hoge" に対して再起動に検索
75:#+caption: ripgrep を使ってカレントディレクトリを "hoge" に対して再起動に検
#+end_example


*** 結論

grep のかわりに ripgrep を使いましょう。




